// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Input first number: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int secondNumber = Convert.ToInt32(Console.ReadLine());

int max;
if (firstNumber > secondNumber)
{
    max = firstNumber;    
}
else
{
    max = secondNumber;
}
Console.WriteLine("Max number is " + max);
*/

